In [2]:
#Connect to mysql
import pymysql
import pandas as pd
import numpy as np
conn=pymysql.connect(host='localhost',port=int(3308),user='root',passwd='',db='fidness')

In [3]:
#select user table
df=pd.read_sql_query("SELECT * FROM fid_gouvernorat ",conn)
df.head()

   id        nom
0   1     ariana
1   2       béja
2   3  ben arous
3   4    bizerte
4   5      gabès

In [4]:
#exportiiiing
from sqlalchemy import create_engine
engine = create_engine('mysql+pymysql://root:@localhost:3308/fid_db')
df.to_sql(name='fid_gouvernorat',con=engine,if_exists='replace')